Repository: Mohamed-Kaizen/E-donations
Catalog: local/*/LC_MESSAGES/django.po
Languages: am

source: contact
am: አድራሻዎች

source: title
am: ርዕስ

source: full name
am: ሙሉ ስም

source: email address
am: ኢሜይል

source: phone number
am: ስልክ ቁጥር

source: message
am: መልእክት

source: created at
am: የተፈጠረው በ

source: contacts
am: አድራሻዎች

source: Donations
am: መዋጮዎች

source: COVID-19
am: ኮቪድ -19

source: MAKEDONIA
am: መቄዶንያ

source: SELE ENAT CHARITABLE
am: ስለ እናት በጎ አድራጎት

source: ETHIOPIAN CENTER FOR DISABILITY AND DEVLOPMENT
am: የኢትዮIያ አካለ ስንኩልነት እና የእድገት ውስንነት ማእከል

source: HEART
am: ልብ

source: KIDENY
am: ኩላሊት

source: LIVER
am: ጉበት

source: LUNG
am: ሳምባ

source: PANCREAS
am: ጨጎራ

source: INTESTINES
am: አንጅት

source: donor
am: ለጋሽ

source: blood type
am: የደም አይነት

source: code
am: ኮድ

source: number
am: ቁጥር

source: country
am: ሀገር

source: city
am: ከተማ

source: amount
am: መጠን

source: height
am: ቁመት

source: weight
am: ክብደት

source: last donate date
am: የመጨረሻ የልገሳ ቀን

source: do you have hiv
am: HዒV አለብክ

source: do you use drugs
am: አደንዛዥ ዕፅ ይጠቀማሉ

source: do you have diabetes
am: የስኳር በሽታ አለብዎት

source: had a tattoo
am: ንቅሳት ነበረው

source: been injured with a used needle
am: በተጠቀመበት መርፌ ተጎድቷል

source: had a blood transfusion
am: ደም ሰተው ያውካሉ

source: been imprisoned in a prison
am: በእስር ቤት ታስረው ነበር

source: feedback
am: ግብረ መልስ

source: bloods
am: ደም

source: organ
am: አካል

source: allergies
am: አለርጂዎች

source: medications
am: መድኃኒቶች

source: do you have a disease
am: በሽታ አለህ

source: do you have a asthma
am: አስም አለህ

source: do you have a hypertension
am: የደም ግፊት አለህ

source: do you have a tuberculosis
am: የሳንባ ነቀርሳ / ሕመም አለብዎት

source: do you have a cardiovascular
am: የልብና የደም ቧንቧ ሕክምና አለህ

source: do you have a transplants
am: መተላለፊያዎች አሎት

source: do you have a education
am: ትምህርት አለህ

source: organ date registration
am: የአካል ቀን ምዝገባ

source: organs
am: አካላት

source: name
am: ስም

source: picture
am: ስዕል

source: acceptor
am: ተቀባይ

source: acceptors
am: ተቀባዮች

source: organization
am: ድርጅት

source: fixed amount
am: የተወሰነ መጠን

source: sponsors
am: ድጋፍ ሰጭ

source: English
am: እንግሊዝኛ

source: Amharic
am: አማርኛ

source: Dev
am: በ ስራ ላይ

source: Production
am: ምርት

source: Permissions
am: ፈቃዶች

source: Personal info
am: የግል መረጃ

source: Important dates
am: አስፈላጊ ቀናት

source: E-donations site admin
am: E-donations ጣቢያ አስተዳዳሪ

source: E-donations Dashboard
am: E-donations ዳሽቦርድ

source: Welcome to E-donations
am: ወደ E-donations እንኳን በደህና መጡ

source: Users
am: ተጠቃሚዎች

source: unique id
am: ልዩ መታወቂያ

source: date of birth
am: የትውልድ ቀን

source: profile
am: መገለጫ

source: profiles
am: መገለጫዎች

source: Total Blood Donation
am: አጠቃላይ የደም ልገሳ

source: Total Money Donation
am: ጠቅላላ ገንዘብ ልገሳ

source: Organs
am: አካል

source: This name cannot be registered.Please choose a different name.
am: ይህ ስም መመዝገብ አይችልም። እባክዎ የተለየ ስም ይምረጡ።

source: This email address cannot be registered. Please supply a different email address.
am: ይህ የኢሜይል አድራሻ መመዝገብ አይችልም ፡፡ እባክዎ የተለየ ኢሜል ያቅርቡ

source: invalid
am: አያገለግልም
